package chapter2.ch05;

public class Algorithm {
	
/*	
	0803. 자료구조 1 (선형 자료구조)
    선형 자료구조란, 앞 뒤 배열의 요소가 1:1의 관계인 자료구조를 뜻한다.
    
    1) 배열(array) : 가장 기본적인 형태. 
       주요 특징으로는 '중간이 비어 있으면 안된다', '물리/논리적 주소가 같다(속도가 빠르다)', '배열 크기를 먼저 선언한다' 등
    
    2) 연결 리스트(Linked List)
       필요에 따라 메모리를 allocation한다. 각 노드마다 다음 엘리먼트를 가리킬 링크(주소)를 가지고 있다.
       물리적 / 논리적 주소가 다를 수 있다. 노드 간 변경(추가, 삭제)이 훠어얼씬 간편하다!
       
    3) 스택 : 가장 나중에 입력된 자료가 가장 먼저 출력되는 자료구조 (후입선출) ex) 은행의 동전쌓기, 쌓아놓은 신발상자
       데이터 추가 (PUSH), 데이터 삭제(POP)
       로컬함수의 지역변수들이 대개 스택형식이다.
    
    4) 큐 : 가장 먼저 입력된 자료가 가장 먼저 출력되는 자료구조 (front / rear) (선입선출)
       자료 추가(enqueue), 자료 삭제(dequeue)
       
*/
	
	public static void main(String[] args) {
		
	}
	
	
}
